# Выведите текущее время в любом формате

import datetime

print(datetime.datetime.now().time())
