# Напишите программу, которая выводит сумму введенных
# пользователем чисел. Числа вводятся одной строкой.

x = [1, 5, 7, 3, 2, 9]

sum = 0

for i in x:
    sum += i

print(sum)
