# Вывести все заглавные буквы в строке

string = 'adffbdfSFDFGdfdfgERTE'

for i in string:
    if i.isupper():
        print(i, end='')
