# Напишите программу, которая сортирует заданный список из чисел

list = ['topic_1', '23', '435', '143', 'topic_2', 'topic_1']

print(sorted(list, key = int))
