# Напишите программу, которая считает сколько букв ‘o’ в заданной строке

string = 'werteooooetwerwertooowertoooo'
print(string.count('o'))
