# Напишите программу, которая переводит температуру в Кельвинах в Цельсии

kelvin = int(input('Enter temperature: '))

celsius = kelvin - 273
print(celsius)
