# Напишите программу, которая преобразует строку, в которой записаны слова через “,” в список из этих слов

string = ['s', 'g', 'h', 'n']

print(' '.join(string))
